podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FB_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
-->
      <peripheral>
         <?sourceFile "FB_MK82F25615" ?>
         <name>FB</name>
         <description>FlexBus external bus interface</description>
         <groupName>FB</groupName>
         <prependToName>FB_</prependToName>
         <headerStructName>FB</headerStructName>
         <baseAddress>0x4000C000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x48</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x60</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>6</dim>
               <dimIncrement>12</dimIncrement>
               <dimIndex>0,1,2,3,4,5</dimIndex>
               <name>CS,@p@f@i</name>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CSAR</name>
                  <description>Chip Select Address Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>BA</name>
                        <description>Base Address</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSMR</name>
                  <description>Chip Select Mask Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>V</name>
                        <description>Valid</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Chip-select is invalid</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Chip-select is valid</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WP</name>
                        <description>Write Protect</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Write accesses are allowed</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Write accesses are not allowed. Attempting to write to the range of addresses for which the WP bit is set results in a bus error termination of the internal cycle and no external cycle</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAM</name>
                        <description>Base Address Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The corresponding address bit in CSAR is used in the chip-select decode</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The corresponding address bit in CSAR is a don&apos;t care in the chip-select decode</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSCR</name>
                  <description>Chip Select Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <resetValue>0x3FFC00</resetValue>
                  <fields>
                     <field>
                        <name>BSTW</name>
                        <description>Burst-Write Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disabled. Data exceeding the specified port size is broken into individual, port-sized, non-burst writes. For example, a 32-bit write to an 8-bit port takes four byte writes</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enabled. Enables burst write of data larger than the specified port size, including 32-bit writes to 8- and 16-bit ports, 16-bit writes to 8-bit ports, and line writes to 8-, 16-, and 32-bit ports</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BSTR</name>
                        <description>Burst-Read Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disabled. Data exceeding the specified port size is broken into individual, port-sized, non-burst reads. For example, a 32-bit read from an 8-bit port is broken into four 8-bit reads</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enabled. Enables data burst reads larger than the specified port size, including 32-bit reads from 8- and 16-bit ports, 16-bit reads from 8-bit ports, and line reads from 8-, 16-, and 32-bit ports</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BEM</name>
                        <description>Byte-Enable Mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>FB_BE is asserted for data write only</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>FB_BE is asserted for data read and write accesses</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PS</name>
                        <description>Port Size</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>00</name>
                              <description>32-bit port size. Valid data is sampled and driven on FB_D[31:0]</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>01</name>
                              <description>8-bit port size. Valid data is sampled and driven on FB_D[31:24] when BLS is 0b, or FB_D[7:0] when BLS is 1b</description>
                              <value>0b01</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AA</name>
                        <description>Auto-Acknowledge Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disabled. No internal transfer acknowledge is asserted and the cycle is terminated externally</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enabled. Internal transfer acknowledge is asserted as specified by WS</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BLS</name>
                        <description>Byte-Lane Shift</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Not shifted. Data is left-aligned on FB_AD</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Shifted. Data is right-aligned on FB_AD</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WS</name>
                        <description>Wait States</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>WRAH</name>
                        <description>Write Address Hold or Deselect</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>00</name>
                              <description>1 cycle (default for all but FB_CS0 )</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>01</name>
                              <description>2 cycles</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10</name>
                              <description>3 cycles</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11</name>
                              <description>4 cycles (default for FB_CS0 )</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RDAH</name>
                        <description>Read Address Hold or Deselect</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>00</name>
                              <description>When AA is 1b, 1 cycle. When AA is 0b, 0 cycles</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>01</name>
                              <description>When AA is 1b, 2 cycles. When AA is 0b, 1 cycle</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10</name>
                              <description>When AA is 1b, 3 cycles. When AA is 0b, 2 cycles</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11</name>
                              <description>When AA is 1b, 4 cycles. When AA is 0b, 3 cycles</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ASET</name>
                        <description>Address Setup</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>00</name>
                              <description>Assert FB_CSn on the first rising clock edge after the address is asserted (default for all but FB_CS0 )</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>01</name>
                              <description>Assert FB_CSn on the second rising clock edge after the address is asserted</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10</name>
                              <description>Assert FB_CSn on the third rising clock edge after the address is asserted</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11</name>
                              <description>Assert FB_CSn on the fourth rising clock edge after the address is asserted (default for FB_CS0 )</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EXTS</name>
                        <description>Extended Transfer Start/Extended Address Latch Enable Controls how long FB_TS /FB_ALE is asserted</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disabled. FB_TS /FB_ALE asserts for one bus clock cycle</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enabled. FB_TS /FB_ALE remains asserted until the first positive clock edge after FB_CSn asserts</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SWSEN</name>
                        <description>Secondary Wait State Enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Disabled. A number of wait states (specified by WS) are inserted before an internal transfer acknowledge is generated for all transfers</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>Enabled. A number of wait states (specified by SWS) are inserted before an internal transfer acknowledge is generated for burst transfer secondary terminations</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SWS</name>
                        <description>Secondary Wait States</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
